# LogicalAndFilter Constructor (IList(ElementFilter))

---
C#Visual BasicVisual C++
Revit 2024 API
---
LogicalAndFilter Constructor (IList<(Of <(<'ElementFilter>)>)>)
LogicalAndFilter Class See Also
---
Constructs a new instance of the logical filter with any number of input filters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public LogicalAndFilter(
	IList<ElementFilter> filters
)
```

Visual Basic
---
```text
Public Sub New ( _
	filters As IList(Of ElementFilter) _
)
```

Visual C++
---
```text
public:
LogicalAndFilter(
	IList<ElementFilter^>^ filters
)
```

# ### Parameters
filters
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementFilter>)>)> A collection of input filters.
# Remarks
The input filters will be copied.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The filter collection is empty, or contains invalid inputs. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LogicalAndFilter Class
LogicalAndFilter Overload
Autodesk.Revit.DB Namespace